Autodesk.Revit.DB.IFC.IFCHybridImport.ImportElements(Autodesk.Revit.DB.Document,System.String)
Imports IFC Elements using non-open-source framework
doc:
Document to receive Elements from Import
file:
Full path of the file to import.
Returns:
Returns an array of ElementIds representing created Elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024